{
"spanish": "Spanish culture has deep roots in Roman, Visigothic, and Islamic traditions, followed by centuries of Catholic monarchic rule. The Reconquista and Spanish Inquisition left a strong imprint on religious norms. During the Franco dictatorship (1939–1975), Catholicism was enforced and regional identities (Catalan, Basque) were suppressed. Modern Spain is democratic but still sensitive to religion, regional autonomy, and family honor, particularly in conservative or rural areas. In Latin America, Spanish colonization imposed Catholic and patriarchal norms, which still shape social expectations, although indigenous and African cultural influences vary by country.",
"portuguese": "Brazilian culture blends Portuguese colonial heritage, indigenous roots, and a large Afro-Brazilian population descended from enslaved Africans. Catholicism is dominant but syncretic religions like Candomblé and Umbanda are deeply important. Brazil is a class-stratified society with strong sensitivities to race, poverty, and police violence. The tension between secularism and evangelical Christianity is also growing. Issues of gender and sexuality have become flashpoints in a country where machismo is still prevalent, and political divides (e.g., pro- vs. anti-Bolsonaro) are sharp and emotionally charged.",
"turkey": "Turkey’s culture is a fusion of Ottoman-Islamic traditions and Western secular ideals, especially since the founding of the Republic in 1923 by Atatürk. Turkish society is deeply divided between secularists and religious conservatives, with strong nationalist currents. Criticism of Islam, Atatürk, or the Turkish military can provoke intense backlash. Family honor and gender roles are also culturally entrenched, and political discourse is often polarized, especially around the current government and Kurdish or Armenian minority issues.",
"korean": "Korean culture emphasizes Confucian social values, hierarchy, and filial piety. The importance of education, respect for elders, and social harmony remains strong. The trauma of Japanese colonialism and the Korean War still influences national identity. While Korea has modernized rapidly, topics like mental health, gender equality, and LGBTQ+ rights remain sensitive. Using the wrong level of politeness or violating norms around honor and shame can be perceived as highly offensive. There is also a deep cultural stigma against failure and nonconformity.",
"germany": "German culture is shaped by both Christian heritage (Catholic and Protestant) and Enlightenment thought. It values order, rationality, and individual responsibility. The trauma of the Nazi era and Holocaust created a strong culture of historical responsibility and anti-racism, making references to fascism, racism, or antisemitism particularly taboo. East-West division (1949–1990) also left differing views on nationalism and state authority. Modern Germany promotes free speech, but there are legal limits on hate speech and Holocaust denial.",
"english": "Both cultures are rooted in Anglo-Protestant values with a strong tradition of free speech and individualism. However, the UK emphasizes social class and irony, while the US is more direct and polarized, especially on race, politics, and religion. The legacy of slavery, colonialism, and systemic racism is central to US public discourse, particularly post–Black Lives Matter. In both countries, gender and LGBTQ+ issues are frontlines in ongoing culture wars. UK-specific sensitivities include immigration, the monarchy, and Brexit; in the US, gun rights, abortion, and Trump-era politics are flashpoints.",
"china": "Chinese culture emphasizes Confucian values, social harmony, and collective identity over individual expression. The Communist Party plays a central role in shaping public discourse. Censorship and political sensitivity are extremely high around issues like Tiananmen Square, Taiwan, Tibet, and Hong Kong. Public criticism of the government is not tolerated. Traditional values regarding family, success, and reputation (mianzi) remain powerful. Religious practices (Buddhism, Christianity, Islam) are state-regulated and can be sensitive in context.",
"bengali": "Bangladeshi culture is a blend of Bengali traditions and Islamic identity, shaped by colonial history, the 1971 war of independence, and ongoing religious conservatism. Islam is central to many public and private values, and blasphemy is socially unacceptable. There is strong emphasis on family honor, modesty, and obedience to elders. Gender roles are traditional, and topics like premarital sex or homosexuality are considered taboo. Political divides between Awami League and BNP often fuel aggressive rhetoric.",
"hindi": "Indian culture is marked by deep religious and linguistic diversity, but the Hindi-speaking north centers on Hindu traditions with influences from Islam, Christianity, and Sikhism. Caste hierarchy, patriarchy, and religious nationalism continue to shape public discourse. Sensitive topics include cow protection, Kashmir, caste-based violence, and communal riots. Political speech is often emotionally charged, particularly around Hindu-Muslim tensions. Modern progressive views on gender and sexuality are often in tension with conservative social norms.",
"italy": "Italian culture is built on Roman Catholic tradition, family loyalty, and regional pride. Though increasingly secular, religion still influences social norms and politics. Family honor and gender roles are significant; insults involving mothers or suggesting infidelity are highly offensive. Italy also has sharp divides between the industrial north and the agrarian south, and public debate often touches on immigration, mafia influence, and corruption. Satire is common, but some topics—especially around race or family—can be provocative.",
"france": "France values secularism (laïcité), individual liberty, and republican ideals. The culture prizes intellectual debate and freedom of expression, even on sensitive topics like religion. However, there is growing tension over Islamic visibility (e.g., hijabs), race relations, and post-colonial immigration from North Africa. The legacy of the French Revolution, colonialism, and Charlie Hebdo attacks make discussions about free speech, religion, and minority rights especially charged. Satirical or irreverent humor is common, but offense can arise in multicultural contexts."
}
