{
"spanish": "Spanish-speaking cultures emphasize Catholic values, family honor, and regional or national identity. Sensitivities often revolve around religion, insults to family, and political issues such as colonial legacy or regional independence (e.g., Catalonia). In Latin America, there's added weight on race, class, and gender roles, influenced by indigenous, African, and mestizo histories.",
"portuguese": "Brazilian culture mixes Catholicism, Afro-Brazilian religions, and a strong sense of family and class identity. Offensive content often involves racism, religious disrespect, and gender/sexuality taboos. Societal divides are exacerbated by economic inequality and political polarization, particularly around religion and conservatism.",
"turkey": "Turkish culture blends Islamic values, secular nationalism, and a strong honor-based family structure. Topics like religion, Atatürk, and ethnic minorities (e.g., Kurds, Armenians) are highly sensitive. Social norms prioritize modesty, respect for tradition, and patriotism, with growing divides between modern secularists and religious conservatives.",
"korean": "South Korean culture is deeply rooted in Confucian hierarchy, family honor, and social reputation. Sensitivities include mental health, gender roles, and disrespecting elders or authority. While technologically modern, the culture still holds traditional views on conformity, education pressure, and national pride.",
"germany": "German culture values historical awareness, order, and individual responsibility. Offensiveness often arises around Nazism, antisemitism, and xenophobia, which are legally and socially unacceptable. Though secular, Germany is sensitive to issues involving race, immigration, and right-wing extremism due to its 20th-century history.",
"english": "Anglo cultures are marked by individualism, free speech, and a history of colonialism. Offensiveness in the US often centers on race, gender, and politics, while in the UK, class, immigration, and religious satire can be flashpoints. Both societies are polarized and active in public debates on identity and rights.",
"china": "Chinese culture emphasizes social harmony, Confucian values, and collective identity. Extremely sensitive areas include criticism of the government, Taiwan/Tibet, and religion. Political speech is heavily regulated, and public discourse is expected to maintain national unity and avoid controversy, especially online.",
"bengali": "Bangladeshi culture is shaped by Islamic faith, Bengali identity, and a history of colonialism and independence. Sensitivities include religious criticism, gender and family honor, and political divisions. Public offense often stems from challenges to religious norms or Western liberal values perceived as immoral.",
"hindi": "Hindi-speaking Indian culture is influenced by Hinduism, caste hierarchy, and a diverse religious landscape. Offense arises from religious insults, caste discrimination, gender-based criticism, and political ideologies. Nationalism, regional pride, and conservative moral codes are major drivers of sensitivity.",
"italy": "Italian culture centers on family, Catholic traditions, and regional pride. Offensiveness often stems from insults to family (especially mothers), religion, and gender roles. There are sensitivities around immigration, southern stereotypes, and criticism of national pride or institutions.",
"france": "French culture promotes secularism, freedom of expression, and universalism. However, tensions arise over race, religion in public life, and post-colonial identity. Offensive topics include Islamic visibility, anti-immigrant rhetoric, and satire involving religion, especially given past terrorist events tied to free speech."
}
